; domain
(define (domain gears-of-war-headshot)
  (:requirements :strips :typing)
  (:types 
    weapon 
    agent
  )

  (:predicates
    (weapon_location ?w - weapon ?loc) ;
    (knows_where_to_aim ?a - agent)    ;
    (knows_shape_of_shotgun_aim ?a - agent) ;
    (knows_pistol_shots_needed ?a - agent)  ;
    (knows_boomshot_odds ?a - agent)        ;       BoomShot
  )

  ;;
  (:action sniper_shot
    :parameters (?w - weapon ?a - agent)
    :precondition (and
                    (weapon_location ?w still)
                    (not (knows_where_to_aim ?a))
                   )
    :effect (and
             (weapon_location ?w focused)
             (knows_where_to_aim ?a)
            )
  )

  ;;
  (:action shotgun_shot
    :parameters (?a - agent)
    :precondition (not (knows_shape_of_shotgun_aim ?a))
    :effect (knows_shape_of_shotgun_aim ?a)
  )

  ;;
  (:action pistol_shot
    :parameters (?a - agent)
    :precondition (not (knows_pistol_shots_needed ?a))
    :effect (knows_pistol_shots_needed ?a)
  )

  ;;   BoomShot
  (:action boomshot_shot
    :parameters (?w - weapon ?a - agent)
    :precondition (and
                    (weapon_location ?w unfired)
                    (not (knows_boomshot_odds ?a))
                   )
    :effect (and
             (weapon_location ?w fired)
             (knows_boomshot_odds ?a)
            )
  )
)

; problem
(define (problem gears-of-war-headshot-problem)
  (:domain gears-of-war-headshot)
  (:objects
    weapon1 weapon2 - weapon
    player1 player2 player3 player4 - agent
  )

  (:init
    (weapon_location weapon1 still)
    (weapon_location weapon2 unfired)
    (not (knows_where_to_aim player1))
    (not (knows_shape_of_shotgun_aim player2))
    (not (knows_pistol_shots_needed player3))
    (not (knows_boomshot_odds player4))
  )

  (:goal
    (and
      (weapon_location weapon1 focused)
      (knows_where_to_aim player1)
      (knows_shape_of_shotgun_aim player2)
      (knows_pistol_shots_needed player3)
      (weapon_location weapon2 fired)
      (knows_boomshot_odds player4)
    )
  )
)

; plan
1. (sniper_shot weapon1 player1)
   added: (weapon_location weapon1 focused) (knows_where_to_aim player1)
   goals met: 2 of 6
2. (shotgun_shot player2)
   added: (knows_shape_of_shotgun_aim player2)
   goals met: 3 of 6
3. (pistol_shot player3)
   added: (knows_pistol_shots_needed player3)
   goals met: 4 of 6
4. (boomshot_shot weapon2 player4)
   added: (weapon_location weapon2 fired) (knows_boomshot_odds player4)
   goals met: 6 of 6
